'##::::::::::'###::::'########:::::'###::::::::::::::'#######::
 ##:::::::::'## ##::: ##.... ##:::'## ##::::::::::::'##.... ##:
 ##::::::::'##:. ##:: ##:::: ##::'##:. ##:::::::::::..::::: ##:
 ##:::::::'##:::. ##: ########::'##:::. ##:'#######::'#######::
 ##::::::: #########: ##.... ##: #########:........:'##::::::::
 ##::::::: ##.... ##: ##:::: ##: ##.... ##:::::::::: ##::::::::
 ########: ##:::: ##: ########:: ##:::: ##:::::::::: #########:
#........::..:::::..::........:::..:::::..:::::::::::.........::
#Код на проверку пароля
a=input('Enter your password - ')
b=input('Enjter your password again - ')
if a==b:
    print('Correct')
else:
    print('not correct your password')
#Категория места у пассажира
ai=int(input('Напишите нмоер вашего места - '))
if ai % 2:
    print('место у окна')
elif ai % 10:
    print('место у прохода')
else:
    print('Одноместое место')
#Високостный год
year=int(input('напишите год - '))
if (year%4==0) and (year%100 !=0) or (year % 400==0):
    print('Да весокостный')
else:
    print('Не весокостный')
#Cмешивание цветов
print(
    "Введите два цвета чтобы узнать какой получится "
    "Варианты - красный синий желтый "
)
cvet_1=str(input("Введите первый цвет - "))
cvet_2=str(input("Введите второй цвет - "))
if cvet_1=='красный' and cvet_2=='синий':
    print('получится фиолетовый!')
elif cvet_1=="красный" and cvet_2=="желтый":
    print("Получится ораенжевый!")
elif cvet_1=="синий" and cvet_2=="желтый":
    print("получится зеленый!")
else:
    print("Не распознование цвета")
#n число
noe_chislo=input('Введите прделожение - ')
print(noe_chislo.replace(' ',''))